---
type: Space
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 55
tags: [revit-api, class]
---

# Space

`Autodesk.Revit.DB.Mechanical.Space` · Revit 2024 · 55 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsPointInSpace | — | `public bool IsPointInSpace ( XYZ point )` |
| Property | ActualExhaustAirflow | — | `public double ActualExhaustAirflow { get ; }` |
| Property | ActualHVACLoad | — | `public double ActualHVACLoad { get ; }` |
| Property | ActualLightingLoad | — | `public double ActualLightingLoad { get ; }` |
| Property | ActualOtherLoad | — | `public double ActualOtherLoad { get ; }` |
| Property | ActualPowerLoad | — | `public double ActualPowerLoad { get ; }` |
| Property | ActualReturnAirflow | — | `public double ActualReturnAirflow { get ; }` |
| Property | ActualSupplyAirflow | — | `public double ActualSupplyAirflow { get ; }` |
| Property | AirChangesPerHour | — | `public double AirChangesPerHour { get ; }` |
| Property | AreaperPerson | — | `public double AreaperPerson { get ; set ; }` |
| Property | AverageEstimatedIllumination | — | `public double AverageEstimatedIllumination { get ; }` |
| Property | BaseHeatLoadOn | — | `public BaseLoadOn BaseHeatLoadOn { get ; set ; }` |
| Property | BaseOffset | — | `public double BaseOffset { get ; set ; }` |
| Property | CalculatedCoolingLoad | — | `public double CalculatedCoolingLoad { get ; }` |
| Property | CalculatedHeatingLoad | — | `public double CalculatedHeatingLoad { get ; }` |
| Property | CalculatedSupplyAirflow | — | `public double CalculatedSupplyAirflow { get ; }` |
| Property | CeilingReflectance | — | `public double CeilingReflectance { get ; set ; }` |
| Property | ClosedShell | — | `public GeometryElement ClosedShell { get ; }` |
| Property | ConditionType | — | `public ConditionType ConditionType { get ; set ; }` |
| Property | DesignCoolingLoad | — | `public double DesignCoolingLoad { get ; set ; }` |
| Property | DesignExhaustAirflow | — | `public double DesignExhaustAirflow { get ; set ; }` |
| Property | DesignHVACLoadperArea | — | `public double DesignHVACLoadperArea { get ; set ; }` |
| Property | DesignHeatingLoad | — | `public double DesignHeatingLoad { get ; set ; }` |
| Property | DesignLightingLoad | — | `public double DesignLightingLoad { get ; set ; }` |
| Property | DesignOtherLoadperArea | — | `public double DesignOtherLoadperArea { get ; set ; }` |
| Property | DesignPowerLoad | — | `public double DesignPowerLoad { get ; set ; }` |
| Property | DesignReturnAirflow | — | `public double DesignReturnAirflow { get ; set ; }` |
| Property | DesignSupplyAirflow | — | `public double DesignSupplyAirflow { get ; set ; }` |
| Property | FloorReflectance | — | `public double FloorReflectance { get ; set ; }` |
| Property | LatentHeatGainperPerson | — | `public double LatentHeatGainperPerson { get ; set ; }` |
| Property | LightingCalculationWorkplane | — | `public double LightingCalculationWorkplane { get ; set ; }` |
| Property | LightingLoadUnit | — | `public BaseLoadOn LightingLoadUnit { get ; set ; }` |
| Property | LimitOffset | — | `public double LimitOffset { get ; set ; }` |
| Property | NumberofPeople | — | `public double NumberofPeople { get ; set ; }` |
| Property | OccupancyUnit | — | `public OccupancyUnit OccupancyUnit { get ; set ; }` |
| Property | Occupiable | — | `public bool Occupiable { get ; }` |
| Property | OutdoorAirFlowStandard | — | `public OutdoorAirFlowStandard OutdoorAirFlowStandard { get ; }` |
| Property | OutdoorAirPerArea | — | `public double OutdoorAirPerArea { get ; }` |
| Property | OutdoorAirPerPerson | — | `public double OutdoorAirPerPerson { get ; }` |
| Property | OutdoorAirflow | — | `public double OutdoorAirflow { get ; }` |
| Property | Parameter | — | `` |
| Property | Plenum | — | `public bool Plenum { get ; }` |
| Property | PowerLoadUnit | — | `public BaseLoadOn PowerLoadUnit { get ; set ; }` |
| Property | ReturnAirflow | — | `public ReturnAirflowType ReturnAirflow { get ; set ; }` |
| Property | Room | — | `public Room Room { get ; }` |
| Property | SensibleHeatGainperPerson | — | `public double SensibleHeatGainperPerson { get ; set ; }` |
| Property | SpaceCavityRatio | — | `public double SpaceCavityRatio { get ; }` |
| Property | SpaceConstruction | — | `public MEPSpaceConstruction SpaceConstruction { get ; }` |
| Property | SpaceType | — | `public SpaceType SpaceType { get ; set ; }` |
| Property | SpaceTypeId | — | `public ElementId SpaceTypeId { get ; set ; }` |
| Property | UnboundedHeight | — | `public double UnboundedHeight { get ; }` |
| Property | UpperLimit | — | `public Level UpperLimit { get ; set ; }` |
| Property | Volume | — | `public double Volume { get ; }` |
| Property | WallReflectance | — | `public double WallReflectance { get ; set ; }` |
| Property | Zone | — | `public Zone Zone { get ; }` |